In [1]:
# Importing necessary libraries

import numpy as np
import pandas as pd

In [2]:
# Reading data

client_data = pd.read_excel('Source_data/client_information.xlsx', sheet_name='data')
loan_data = pd.read_excel('Source_data/loan_information.xlsx', sheet_name='data')
outcome_data = pd.read_excel('Source_data/loan_outcome_information.xlsx', sheet_name='data')

### Investigating Client data

In [3]:
# Data overview
client_data.head()

,clientid,region,branch,client_gender,income,vehicle_production_year,vehicle_initial_assessment_value,age,had_car_loan,had_other_loans
0,0,region 9,branch 3,male,1214,2002,9600,37.0,0,0
1,1,NaN,branch 3,male,0,1995,6480,36.0,0,0
2,2,region 2,branch 5,male,720,1999,5280,57.0,0,0
3,3,NaN,branch 3,female,0,2000,10560,65.0,0,0
4,4,region 6,branch 2,male,0,2008,7680,35.0,0,0

In [4]:
# Check for Nans and Data types
client_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10970 entries, 0 to 10969
Data columns (total 10 columns):
 #   Column                            Non-Null Count  Dtype
---  ------                            --------------  -----
 0   clientid                          10970 non-null  int64
 1   region                            9880 non-null   object
 2   branch                            10970 non-null  object
 3   client_gender                     10970 non-null  object
 4   income                            10970 non-null  int64
 5   vehicle_production_year           10970 non-null  int64
 6   vehicle_initial_assessment_value  10970 non-null  int64
 7   age                               10948 non-null  float64
 8   had_car_loan                      10970 non-null  int64
 9   had_other_loans                   10970 non-null  int64
dtypes: float64(1), int64(6), object(3)
memory usage: 857.2+ KB

**Only column containing nans are region and age**

In [5]:
# Checking unique values
client_data.apply(lambda x: len(x.unique()))

clientid                            10970
region                                 13
branch                                  7
client_gender                           2
income                                383
vehicle_production_year                35
vehicle_initial_assessment_value      489
age                                    58
had_car_loan                            2
had_other_loans                         2
dtype: int64

**Both region and benach, cateogorical data, have not many unique values, so we can use One hot enocoding for them**

In [6]:
# Making new value for Unknown regions
client_data['region'] = client_data['region'].fillna('Unknown')

In [7]:
client_data['age'].isnull().sum() * 100 / len(client_data)

0.20054694621695535

**As onlu 0.2% of age data contains nulls, let's replace them with mode**

In [8]:
client_data['age'] = client_data['age'].fillna(client_data['age'].mode().iloc[0])

### Investingeting Loan data

In [9]:
# Data overview
loan_data.head()

,clientid,loan_type,loan_initial_term,loan_initial_amount,loan_to_value_ratio,annual_percentage_rate,monthly_interest_rate
0,0,leaseback,36,1920,0.200000,35.875763,3.374
1,1,leaseback,54,5040,0.777778,36.079749,3.374
2,2,leasing,18,2400,0.454545,42.292028,3.374
3,3,leaseback,36,9360,0.886364,35.580055,3.374
4,4,leasing,54,5760,0.750000,37.090166,3.374

In [10]:
# Cheking for Nans and data types
loan_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10970 entries, 0 to 10969
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   clientid                10970 non-null  int64
 1   loan_type               10970 non-null  object
 2   loan_initial_term       10970 non-null  int64
 3   loan_initial_amount     10970 non-null  int64
 4   loan_to_value_ratio     10970 non-null  float64
 5   annual_percentage_rate  10970 non-null  float64
 6   monthly_interest_rate   10970 non-null  float64
dtypes: float64(3), int64(3), object(1)
memory usage: 600.1+ KB

In [11]:
# Checking unique values
loan_data.apply(lambda x: len(x.unique()))

clientid                  10970
loan_type                     2
loan_initial_term            35
loan_initial_amount         232
loan_to_value_ratio        1120
annual_percentage_rate     7182
monthly_interest_rate         3
dtype: int64

**For cateforical variables, also can be used One hot encoding**

### Investigateing Outcome data

In [12]:
# Data overview
outcome_data.head()

   clientid client_type     ratio
0         0     default  1.166667
1         1     default  1.027778
2         2     default  0.916667
3         3     default  0.916667
4         4     default  0.888889

In [13]:
# Cheking for Nans and data types
outcome_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10970 entries, 0 to 10969
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   clientid     10970 non-null  int64
 1   client_type  10970 non-null  object
 2   ratio        8389 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 257.2+ KB

**Numerical ratio variable do have Nans, so should be chosen either to impute data or remove that samples**

In [14]:
# Getheriing all data together (by ID column)

data_interim = pd.merge(client_data, loan_data)
data = pd.merge(data_interim, outcome_data)

In [15]:
data.head()

,clientid,region,branch,client_gender,income,vehicle_production_year,vehicle_initial_assessment_value,age,had_car_loan,had_other_loans,loan_type,loan_initial_term,loan_initial_amount,loan_to_value_ratio,annual_percentage_rate,monthly_interest_rate,client_type,ratio
0,0,region 9,branch 3,male,1214,2002,9600,37.0,0,0,leaseback,36,1920,0.200000,35.875763,3.374,default,1.166667
1,1,Unknown,branch 3,male,0,1995,6480,36.0,0,0,leaseback,54,5040,0.777778,36.079749,3.374,default,1.027778
2,2,region 2,branch 5,male,720,1999,5280,57.0,0,0,leasing,18,2400,0.454545,42.292028,3.374,default,0.916667
3,3,Unknown,branch 3,female,0,2000,10560,65.0,0,0,leaseback,36,9360,0.886364,35.580055,3.374,default,0.916667
4,4,region 6,branch 2,male,0,2008,7680,35.0,0,0,leasing,54,5760,0.750000,37.090166,3.374,default,0.888889

In [16]:
data.to_csv('Derived_data/Data_processed.csv', index = False)